Tekla Open API Reference for Tekla Structures 2025
PointCloud Methods
The PointCloud type exposes the following members.
Methods
Name | Description
Attach
 Attach this point cloud to model. Can select only Potree type point clouds immediately after attach. Others need to be selected manually after attach has been completed. Use AttachComplete() to find out, if attach process has completed.
AttachComplete
 Checks if the point cloud attach is complete. Needed when attaching non-Potree point cloud file, which needs conversion.
Detach
 Detach this point cloud from model.
GetPointClouds
 Utility function: Gets available point clouds.
GetVisibleInViews
 Gets the views in which this point cloud is visible.
Select
 Select point cloud by Guid, by Name, by OriginalPath or by Url.
SetVisibility
 Set point cloud visibility in given views.
Top
See Also
Reference
PointCloud Class
Tekla.Structures.Model Namespace